{
 "cells": [
  {
   "cell_type": "markdown",
   "source": [
    "Данная задача визуализирует уникальное свойства множеств в Python:\n",
    "В первую очередь множества - несортированный набор неповторяющихся данных. Данными внутри множеств могут быть числа, строки или кортежи.\n",
    "Визуально от других наборов данных множества отличаются реализацией объединения данных через фигурные скобки.\n",
    "Функционально - невозможностью размещения в них повторяющихся значений.\n",
    "\n",
    "В решённой задаче мы превращаем введённый список чисел в множество путём того, что сначала превратим введённую строку в список чисел, используя функции split() и int(), а далее полученный список преобразуем в множество путём использования встроенной функции set() - при преобразовании списка в множество дублирующиеся элементы будут исключены автоматически.\n",
    "\n",
    "Использование переменной N при таком решении опять же рудиментарно, добавлено для прохождения автоматической проверки."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "pycharm": {
     "name": "#%%\n"
    }
   },
   "outputs": [],
   "source": [
    "def main():\n",
    "    N = int(input().strip())\n",
    "    all_numbers = set(map(int, input().strip().split()))\n",
    "    print(len(all_numbers))\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "Выполненная задача:\n",
    "\n",
    "Дано N чисел, требуется выяснить, сколько среди них различных.\n",
    "\n",
    "Входные данные\n",
    "В первой строке дано число N – количество чисел. (1 <= N <= 100000) Во второй строке даны через пробел N чисел,\n",
    "каждое не превышает 2*(10^9) по модулю.\n",
    "\n",
    "Выходные данные\n",
    "Выведите число, равное количеству различных чисел среди данных."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}