{
 "cells": [
  {
   "cell_type": "markdown",
   "source": [
    "В данной задаче мы создаём пустое множество, далее вводим поступающее количество запросов N и реализуем эти запросы через консоль.\n",
    "Для осуществления выполнения конкретного количества запросов N запустим цикл for от 0 до N. Внутри цикла принимаем через клавиатуру заданный запрос, и в зависимости от введённого запроса выполняем следующие алгоритмы:\n",
    "При запросе ADD <число> - добавляем указанное число в множество,\n",
    "При запросе COUNT - выводим в консоль количество элементов в множество,\n",
    "При запросе PRESENT <число> - выводим в консоль ответ на вопрос, присутствует ли указанное число в множестве.\n",
    "Такая программа помогает визуализировать свойства множеств - с её помощью мы можем наглядно увидеть, что при добавлении, например, одинаковых чисел, количество элементов в множестве останется равным количеству единичных экземпляров чисел, а через проверку PRESENT мы можем увидеть, что элемент действительно добавлен во множество.\n",
    "\n",
    "Также примечательно, что в коде мы используем ранее не встречавшуюся в решениях функцию add() для множеств - она добавляет элемент, указанный в параметре, в начало множества.\n",
    "Укажем также некоторые другие функции для множеств:\n",
    "Очистка множества - clear()\n",
    "Удаление элемента по индексу - remove()\n",
    "Удаление последнего элемента и возврат - pop()\n",
    "Проверка между двумя множествами на подмножество - issubset()\n",
    "Проверка на надмножество - issuperset()"
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "pycharm": {
     "name": "#%%\n"
    }
   },
   "outputs": [],
   "source": [
    "def main():\n",
    "    my_set = set()\n",
    "    N = int(input().strip())\n",
    "    for _ in range(N):\n",
    "        query = input().strip().split()\n",
    "        if query[0] == 'ADD':\n",
    "            my_set.add(int(query[1]))\n",
    "        elif query[0] == 'PRESENT':\n",
    "            num = int(query[1])\n",
    "            if num in my_set:\n",
    "                print(\"YES\")\n",
    "            else:\n",
    "                print(\"NO\")\n",
    "        elif query[0] == 'COUNT':\n",
    "            print(len(my_set))\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "Выполненная задача:\n",
    "\n",
    "Напишите программу, которая будет выполнять последовательность запросов вида ADD num, PRESENT num и COUNT\n",
    "(без параметра). Программу обязательно следует писать с использованием шаблонного типа set.\n",
    "\n",
    "Выполнение каждого запроса вида ADD num должно добавлять элемент num во множество (если такой элемент уже есть,\n",
    "добавление ещё одной копии не изменяет множество), на экран при этом ничего не выводится.\n",
    "\n",
    "При выполнении каждого запроса вида PRESENT num должно выдаваться сообщение «YES» или «NO»\n",
    "(большими буквами, в отдельной строке), соответственно тому, есть ли такой элемент во множестве; значение множества при\n",
    "этом не изменяется.\n",
    "\n",
    "При выполнении каждого запроса вида COUNT должна выдаваться на экран в отдельной строке текущее количество различных\n",
    "элементов в множестве; значение множества при этом не изменяется.\n",
    "\n",
    "Входные данные\n",
    "В первой строке стандартного входного потока задано количество запросов N (1<N<100000),\n",
    "далее следуют N строк, каждая из которых содержит по одному запросу согласно описанного формата.\n",
    "\n",
    "Значения чисел не превышают по модулю 100000000.\n",
    "\n",
    "Выходные данные\n",
    "Выводите на стандартный выход (экран) в отдельных строках результаты запросов PRESENT и COUNT;\n",
    "на запросы ADD ничего выводить не надо."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}