{
 "cells": [
  {
   "cell_type": "markdown",
   "source": [
    "Словари - следующая структура в Python, способная сохранять наборы данных. Визуально они идентичны множествам в плане использования фигурных скобок для инициализации, но имеют отличие в виде сохранения пар \"ключ-значение\", в то время как множества хранят внутри только сами значения объектов.\n",
    "Словарь может быть инициализирован либо через функцию dict() (пример: dict(One = \"1\", Two = \"2\")), либо через присваивание переменной самого словаря (пример: {\"One\": '1', \"Two\": '2'}). Получение данных из словаря работает через указание ключа в квадратных скобках.\n",
    "Примечательно, что в рамках нашей задачи также используем функцию get() для словарей - она может принять два параметра - первым ключ словаря, значение для которого мы хотим извлечь из функции, а вторым значение, которое вернёт функция при отсутствии указанного ключа. У нас данная функция встречается в восемнадцатой строке, где мы присваиваем по значению ключа элементу словаря сумму средств уже учтённых в словаре (либо же 0) и добавляемую вновь сумму (в случае 0 - впервые).\n",
    "В общем наша программа состоит из инициализации словаря, последующего ввода через клавиатуру числа, равного количеству требуемых запросов, поле чего мы вводим сами запросы по стандартным конструкциям, и реализуем либо изменение в словаре суммы счёта клиента, либо вывод его актуальной суммы на балансе."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "pycharm": {
     "name": "#%%\n"
    }
   },
   "outputs": [],
   "source": [
    "def main():\n",
    "\n",
    "    client_accounts = {}\n",
    "    N = int(input().strip())\n",
    "    for _ in range(N):\n",
    "        query = input().strip().split()\n",
    "\n",
    "        if query[0] == '1':\n",
    "            name = query[1]\n",
    "            amount = int(query[2])\n",
    "            client_accounts[name] = client_accounts.get(name, 0) + amount\n",
    "\n",
    "        elif query[0] == '2':\n",
    "            name = query[1]\n",
    "            if name in client_accounts:\n",
    "                print(client_accounts[name])\n",
    "            else:\n",
    "                print('ERROR')\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "Выполненная задача:\n",
    "\n",
    "У банка есть клиенты. Каждый клиент имеет ровно один счет.\n",
    "\n",
    "Напишите программу (обязательно с использованием ассоциативного массива), которая будет выполнять последовательность\n",
    "запросов таких двух видов:\n",
    "\n",
    "1) начинается с числа 1, затем через пробел следует имя клиента (слово из латинских букв), далее через пробел идет сумма\n",
    "денег, которая прилагается к счету текущего клиента (целое число, не превышает по модулю 10000).\n",
    "\n",
    "2) начинается с числа 2, через пробел следует имя клиента. На каждый такой запрос программа должна ответить какая сумма\n",
    "в данный момент есть на счету заданного клиента. Если такое имя клиента пока ни разу не упоминалось в запросах вида 1,\n",
    "выводите вместо числа слово ERROR.\n",
    "\n",
    "В начале работы программы у всех клиентов на счету 0. Затем суммы могут становиться как положительными, так и\n",
    "отрицательными.\n",
    "\n",
    "Обратите внимание, что в ситуации, когда клиент снял суммарно ровно столько же денег, сколько положил, сумма на счете\n",
    "становится равной 0; но, раз его имя уже встречалось, нулевое значение не является основанием выводить ERROR.\n",
    "\n",
    "Входные данные\n",
    "Первая строка стандартного входного потока — количество запросов N (1<N<100000). Далее следуют N строк\n",
    "в каждой из которых описан один из двух описанных выше видов запроса.\n",
    "\n",
    "Выходные данные\n",
    "На каждый запрос 2-го вида нужно вывести текущее значение на счету заданного клиента (или слово ERROR)."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}