{
 "cells": [
  {
   "cell_type": "markdown",
   "source": [
    "В этом задании помимо использования словарей добавилась работа с текстовыми файлами в рамках Python.\n",
    "Для файлов существует функция open(), в первом параметре которой мы указываем либо абсолютный (хорошо для использования на единственном компьютере) путь файла, либо относительный (хорошо в случае, если файл будет находиться в одной папке со скриптом и может быть запущен на разных компьютерах), во втором параметре - режим открытия файла.\n",
    "Режимы открытия файлов бывают следующие:\n",
    "r — чтение\n",
    "w — запись\n",
    "a — добавление\n",
    "r+ — чтение и запись\n",
    "w+ — чтение и запись с очисткой файла\n",
    "a+ — чтение и запись с добавлением\n",
    "В данном случае используем режим чтения, никакую информацию в файл записывать не придётся.\n",
    "Записывая структуру \"with open(input.txt, 'r') as file:\", мы открываем для программы файл input.txt в режиме чтения и присваиваем его переменной file. Далее используем функцию read() для чтения файла (создания структуры строчного типа) и функцию split() для разбиения строки на список отдельных слов.\n",
    "\n",
    "Далее, когда мы привели наш файл к читаемому для компилятора виду, мы реализуем логику выполнения нашей задачи, используя словарь word_count и список repeats. Перебирая циклом for каждое слово строки, мы будем увеличивать значение словаря на единицу, когда встречается одно и тоже слово, в качестве ключа используя это слово. При этом в список каждую итерацию добавляем число, обозначающее количество раз, которое встретилось взятое слово.\n",
    "При выводе распакованный список repeats как раз отобразит динамику изменения количества повторов слов строки."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "pycharm": {
     "name": "#%%\n"
    }
   },
   "outputs": [],
   "source": [
    "def main():\n",
    "\n",
    "    with open('input.txt', 'r') as file:\n",
    "        text = file.read()\n",
    "        words = text.split()\n",
    "        word_count = {}\n",
    "        repeats = []\n",
    "        for word in words:\n",
    "            if word in word_count:\n",
    "                word_count[word] += 1\n",
    "            else:\n",
    "                word_count[word] = 0\n",
    "            repeats.append(word_count[word])\n",
    "        print(*repeats)\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "Выполненная задача:\n",
    "\n",
    "Во входном файле (вы можете читать данные из файла input.txt) записан текст. Словом считается последовательность\n",
    "непробельных символов идущих подряд, слова разделены одним или большим числом пробелов или символами конца строки.\n",
    "\n",
    "Для каждого слова из этого текста подсчитайте, сколько раз оно встречалось в этом тексте ранее.\n",
    "\n",
    "Входные данные\n",
    "Вводится текст.\n",
    "\n",
    "Выходные данные\n",
    "Выведите ответ на задачу."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}