{
 "cells": [
  {
   "cell_type": "markdown",
   "source": [
    "Из примечательных нововведений среди нашего кода в данной задаче реализовано использование функции items() для словарей. Путём использования такой функции мы можем вернуть не только каждое из значений словаря в цикле, но и указанные ключи, что является принципиально важным при выполнении условий выполняемой задачи.\n",
    "Укажем также некоторые другие функции для работы со словарями:\n",
    "keys() — Возвращает список всех ключей в словаре.\n",
    "values() — Возвращает список всех значений в словаре.\n",
    "items() — Возвращает список кортежей, содержащих пары “ключ-значение” (дополнение информации, что функция возвращает список кортежей).\n",
    "get(key, default) — Возвращает значение по указанному ключу. Если ключ отсутствует, возвращает значение default.\n",
    "setdefault(key, default) — Устанавливает значение по ключу, если ключ отсутствует. Возвращает текущее значение по ключу или значение default, если ключ был добавлен.\n",
    "update(other) — Обновляет словарь текущими парами “ключ-значение” из другого словаря.\n",
    "pop(key) — Удаляет элемент с указанным ключом и возвращает его значение. Если ключ отсутствует, возвращает None.\n",
    "popitem() — Удаляет и возвращает случайный элемент словаря (пару “ключ-значение”).\n",
    "clear() — Удаляет все элементы из словаря.\n",
    "\n",
    "В самой программе сначала реализуем ввод через клавиатуру указанного количества пар синонимов, поместим все пары в словарь - пусть первое слово будет ключом, а второе значением. А далее будем проверять, входит ли введённое последним слово в набор ключей или значений, и соотвественно выводим либо нужный ключ, либо нужное значение при нахождении совпадения."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "pycharm": {
     "name": "#%%\n"
    }
   },
   "outputs": [],
   "source": [
    "def main():\n",
    "\n",
    "    n = int(input())\n",
    "    word_pairs = {}\n",
    "    for _ in range(n):\n",
    "        pair = input().split()\n",
    "        word_pairs[pair[0]] = pair[1]\n",
    "    user_input = input()\n",
    "    for k, v in word_pairs.items():\n",
    "        if v == user_input:\n",
    "            print(k)\n",
    "        elif k == user_input:\n",
    "            print(v)\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "Выполненная задача:\n",
    "\n",
    "Вам дан словарь, состоящий из пар слов. Каждое слово является синонимом к парному ему слову.\n",
    "Все слова в словаре различны. Для одного данного слова определите его синоним.\n",
    "\n",
    "Входные данные\n",
    "Программа получает на вход количество пар синонимов N. Далее следует N строк,\n",
    "каждая строка содержит ровно два слова-синонима. После этого следует одно слово.\n",
    "\n",
    "Выходные данные\n",
    "Программа должна вывести синоним к данному слову.\n",
    "\n",
    "Примечание\n",
    "Эту задачу можно решить и без словарей (сохранив все входные данные в списке),\n",
    "но решение со словарем будет более простым."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}