{
 "cells": [
  {
   "cell_type": "markdown",
   "source": [
    "Опять же, открываем файл input.txt в режиме чтения, создаём словарь для подсчёта, а далее смотрим на отдельные строки файла, так как знаем, что в каждой строке указаны только два значения и при этом в упорядоченном виде - сначала фамилии кандидатов, потом количество голосов.\n",
    "В словаре под ключами будем подразумевать фамилии кандидатов, а под значениями - количество голосов как целочисленное значение. При возникновении каждой новой строки увеличиваем значение в словаре под указанным ключём на необходимое количество голосов. Далее сортируем ключи с помощью sorted() - по умолчанию для списка строк как раз фамилии кандидатов отсортируются в лексикографическом порядке. В выводе реализуем пары, состоящие из фамилий кандидатов из отдельного списка и сопутствующие значения словаря."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "pycharm": {
     "name": "#%%\n"
    }
   },
   "outputs": [],
   "source": [
    "def main():\n",
    "\n",
    "    with open('input.txt', 'r') as file:\n",
    "        candidate_votes = {}\n",
    "\n",
    "        for line in file:\n",
    "            candidate, votes = line.strip().split()\n",
    "            candidate_votes[candidate] = candidate_votes.get(candidate, 0) + int(votes)\n",
    "\n",
    "        candidates = sorted(candidate_votes.keys())\n",
    "\n",
    "        for candidate in candidates:\n",
    "            print(candidate, candidate_votes[candidate])\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "Выполненная задача:\n",
    "\n",
    "Как известно, в США президент выбирается не прямым голосованием, а путем двухуровневого голосования. Сначала проводятся\n",
    "выборы в каждом штате, и определяется победитель выборов в данном штате. Затем проводятся государственные выборы:\n",
    "на этих выборах каждый штат имеет определенное число голосов — число выборщиков от этого штата. На практике,\n",
    "все выборщики от штата голосуют в соответствии с результами голосования внутри штата, то есть на заключительной стадии\n",
    "выборов в голосовании участвуют штаты, имеющие различное число голосов.\n",
    "\n",
    "Вам известно за кого проголосовал каждый штат и сколько голосов было отдано данным штатом. Подведите итоги выборов:\n",
    "для каждого из участника голосования определите число отданных за него голосов.\n",
    "\n",
    "Входные данные\n",
    "Каждая строка входного файла содержит фамилию кандидата, за которого отдают голоса выборщики этого штата, затем через\n",
    "пробел идет количество выборщиков, отдавших голоса за этого кандидата.\n",
    "\n",
    "Выходные данные\n",
    "Выведите фамилии всех кандидатов в лексикографическом порядке, затем, через пробел, количество отданных за них голосов."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}