{
 "cells": [
  {
   "cell_type": "markdown",
   "source": [
    "В данной задаче с помощью словаря подсчитаем частоту появления слов в тексте файла input.txt, а далее подберём наиболее часто встречающееся слово и выведем единственное наименьшее с точки зрения лексикографического порядка. Примечательно, что для осуществления такого порядка мы будем использовать, во-первых, функцию min() для указания минимального ключа с точки зрения лексикографической сортировки, во-вторых, лямбда-функцию, что мы также реализуем впервые.\n",
    "\n",
    "В целом лямбда-функции в Python - это \"анонимные\" функции, которые не имеют имени, и определяются ключевым словом lambda, после чего следуют аргументы и через двоеточие - нужное к выполнению выражение.\n",
    "В нашем конкретном случае в качестве выражения мы указываем кортеж из пары -x[1] и x[0] - первый элемент указывает на значение словаря, а второй на его ключ. Так как в параметре key мы определяем конкретный порядок сортировки, то минус перед x[1] будет указывать на обратный от минимума порядок при сортировке по значению и при этом значение словаря приоритетно при сортировке, но при этом сортировку по ключу мы оставляем от минимального к максимальному в лексикографическом порядке.\n",
    "\n",
    "Далее выведем первый элемент полученной переменной (т.е. первое значение словаря после сортировки)."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "pycharm": {
     "name": "#%%\n"
    }
   },
   "outputs": [],
   "source": [
    "def main():\n",
    "    # Открываем файл для чтения\n",
    "    with open('input.txt', 'r') as file:\n",
    "        all_words = file.read().split()\n",
    "\n",
    "        num_words_dict = {}\n",
    "\n",
    "        for word in all_words:\n",
    "            num_words_dict[word] = num_words_dict.get(word, 0) + 1\n",
    "\n",
    "        most_frequent = min(num_words_dict.items(), key=lambda x: (-x[1], x[0]))\n",
    "        print(most_frequent[0])\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "Выполненная задача:\n",
    "\n",
    "Дан текст (строк может быть много). Выведите слово, которое в этом тексте встречается чаще всего. Если таких слов несколько, выведите то, которое меньше в лексикографическом порядке.\n",
    "\n",
    "Входные данные\n",
    "Вводится текст.\n",
    "\n",
    "Выходные данные\n",
    "Выведите ответ на задачу."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}