{
 "cells": [
  {
   "cell_type": "markdown",
   "source": [
    "Реализуем в функции phib логику расчёта чисел Фиббоначчи: первоначальное число будем суммировать с меньшим на единицу пока не дойдём до единицы или двойки."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "pycharm": {
     "name": "#%%\n"
    }
   },
   "outputs": [],
   "source": [
    "def phib(n):\n",
    "    if n == 1 or n == 2:\n",
    "        return 1\n",
    "    else:\n",
    "        return phib(n - 1) + phib(n - 2)"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "Введём число к расчёту, разместим внутри функции и выведем результат в консоль."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "def main():\n",
    "    n = int(input().strip())\n",
    "    print(phib(n))\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%%\n"
    }
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "Выполненная задача:\n",
    "\n",
    "Напишите функцию phib(n), которая по данному целому неотрицательному n возвращает n-e число Фибоначчи.\n",
    "В этой задаче нельзя использовать циклы - используйте рекурсию.\n",
    "\n",
    "phib(1) = phib(2) = 1\n",
    ".phib(n) = phib(n - 1) + phib(n - 2)\n",
    "\n",
    "Входные данные\n",
    "Вводится целое число.\n",
    "\n",
    "Выходные данные\n",
    "Выведите ответ на задачу."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}