"""
Дана строка. Удалите из этой строки все символы @.

Входные данные
Вводится строка.

Выходные данные
Выведите ответ на задачу.
"""
# Ввод строки
input_string = input()

# Удаление всех символов @
new_string = input_string.replace('@', '')

# Вывод результата
print(new_string)

# Изначально забыл убрать черновую пометку