"""
Дана строка. Замените в этой строке все цифры 1 на слово one.

Входные данные
Вводится строка.

Выходные данные
Выведите ответ на задачу.
"""
# Ввод строки
input_string = input()

# Замена всех цифр 1 на слово one
new_string = input_string.replace('1', 'one')

# Вывод результата
print(new_string)