{
 "cells": [
  {
   "cell_type": "markdown",
   "source": [
    "Сначала реализуем необходимый ввод - из примечательного мы будем пары для конфетки размещать в качестве подмножеств внутри множества пар.\n",
    "Саму сортировку реализуем методом пузырька, но просто с дополнительным условием - меняем порядок элементов не только в случае выполнения условия предшествия большего меньшему, но дополнительно проверяем их на отсутствие среди указанных пар.\n",
    "выведем отсортированный распакованный массив в консоль."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "pycharm": {
     "name": "#%%\n"
    }
   },
   "outputs": [],
   "source": [
    "def main():\n",
    "\n",
    "    N = int(input().strip())\n",
    "    arr = list(map(int, input().strip().split()))\n",
    "    M = int(input().strip())\n",
    "\n",
    "    pairs = set()\n",
    "    for _ in range(M):\n",
    "        x, y = map(int, input().strip().split())\n",
    "        pairs.add((x, y))\n",
    "        pairs.add((y, x))\n",
    "\n",
    "    for i in range(N):\n",
    "        for j in range(0, N-i-1):\n",
    "            if arr[j] > arr[j + 1] and (arr[j], arr[j + 1]) not in pairs:\n",
    "                arr[j], arr[j + 1] = arr[j + 1], arr[j]\n",
    "\n",
    "    print(*arr)\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "Выполненная задача:\n",
    "\n",
    "Дан массив из N различных натуральных чисел от 1 до N. Сортировка массива по возрастанию \"пузырьком\"\n",
    "работает следующим образом. Сначала сравниваются первый и второй элемент, и, если первый больше второго,\n",
    "то они меняются местами. Затем та же процедура производится со вторым и третьим элементом, …,\n",
    "с предпоследним и последним. Затем эта процедура снова повторяется с первым и вторым, со вторым и третьим, …,\n",
    "с предпоследним и последним элементами. И так (N – 1) раз.\n",
    "\n",
    "Сортировка «с конфеткой» выполняется по тем же правилам, но дополнительно задан список пар чисел,\n",
    "которые не меняются друг с другом ни при каких условиях (в таком случае сортирующий получает конфетку за то,\n",
    "что пропускает соответствующий обмен). Например, наличие в списке пары (4,1) обозначает, что если в какой-то момент\n",
    "рядом окажутся числа 4 и 1 или 1 и 4, и по алгоритму сортировки их нужно будет поменять местами,\n",
    "то обмена не произойдет, а сортирующий получит конфетку.\n",
    "\n",
    "Требуется провести сортировку «с конфеткой» данного массива и выдать результат сортировки.\n",
    "\n",
    "Входные данные\n",
    "Сначала вводится число N — количество чисел в массиве, затем N чисел — элементы массива.\n",
    "Далее задается число M — количество пар чисел, за которые дают конфетку, а затем M пар чисел.\n",
    "Если в списке есть пара (i,j), то и за пару (j,i) также дают конфетку.\n",
    "\n",
    "1 ≤ N ≤ 5000, 0 ≤ M ≤ 10000."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}