{
 "cells": [
  {
   "cell_type": "markdown",
   "source": [
    "Функция solve(n, k) использует бинарный поиск для нахождения минимального количества дней (result), необходимых для выполнения n задач, если в каждый день можно выполнить k задач плюс дополнительное количество задач, зависящее от номера дня (арифметическая прогрессия). Поиск ведется в диапазоне от 1 до n. В каждой итерации вычисляется общее количество задач, которые можно выполнить за mid дней. Если это количество больше или равно n, то mid является потенциальным решением, и мы уменьшаем правую границу поиска, чтобы найти меньшее количество дней. В противном случае, увеличиваем левую границу. В конце функция возвращает минимальное количество дней (result), за которое можно выполнить все задачи."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "pycharm": {
     "name": "#%%\n"
    }
   },
   "outputs": [],
   "source": [
    "def solve(n, k):\n",
    "    left = 1\n",
    "    right = n\n",
    "    result = n\n",
    "\n",
    "    while left <= right:\n",
    "        mid = (left+right)//2\n",
    "        tasks = mid*k+mid*(mid - 1)//2\n",
    "\n",
    "        if tasks >= n:\n",
    "            result = mid\n",
    "            right = mid-1\n",
    "        else:\n",
    "            left = mid+1\n",
    "\n",
    "    return result"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "В функции main введём значения n и k, а далее разместим их внутри функции solve и полученное из неё значение выведем на экран."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "def main():\n",
    "    n = int(input().strip())\n",
    "    k = int(input().strip())\n",
    "    result = solve(n, k)\n",
    "    print(result)\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%%\n"
    }
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "Выполненная задача:\n",
    "\n",
    "Юра решил подготовиться к региональной олимпиаде по информатике. Он выбрал на сайте N задач, чтобы решить их\n",
    "на каникулах.\n",
    "В первый день Юра решил K задач, а в каждый следующий день Юра решал на одну задачу больше, чем в предыдущий день.\n",
    "Определите, сколько дней уйдет у Юры на подготовку к олимпиаде.\n",
    "\n",
    "Входные данные\n",
    "Программа получает на вход два целых положительных числа N и K (N,K≤2⋅10^9),\n",
    "записанных в отдельных строках — количество задач, которые намерен решить Юра, и количество задач,\n",
    "которые он решил в первый день подготовки.\n",
    "\n",
    "Выходные данные\n",
    "Программа должна вывести единственное число — количество дней, которое потребовалось Юре для решения задач.\n",
    "\n",
    "Примечание\n",
    "В примере в первый день Юра решит 3 задачи, во второй день — 4, в третий день — 5,\n",
    "итого на решение 10 задач у Юры уйдет 3 дня."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}