{
 "cells": [
  {
   "cell_type": "markdown",
   "source": [
    "Функция min_fives(a, b, c) определяет минимальное количество оценок \"5\" (left), которые нужно добавить к существующим оценкам a (оценок \"2\"), b (оценок \"3\") и c (оценок \"4\"), чтобы средний балл группы стал не меньше 4 (с округлением до ближайшего целого). Используется бинарный поиск в диапазоне от 0 до суммы всех оценок. Функция is_valid проверяет, удовлетворяет ли текущее количество оценок \"5\" (mid) условию: средний балл, вычисленный с учетом добавленных оценок \"5\", после округления до ближайшего целого, больше или равен 4. Если условие выполняется, мы уменьшаем правую границу поиска, иначе увеличиваем левую. В итоге функция возвращает минимальное количество оценок \"5\", необходимых для достижения целевого среднего балла."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "pycharm": {
     "name": "#%%\n"
    }
   },
   "outputs": [],
   "source": [
    "def min_fives(a, b, c):\n",
    "    total_grades = a+b+c\n",
    "    target_average = 4\n",
    "\n",
    "    def is_valid(num_fives):\n",
    "        total_score = a*2+b*3+c*4+num_fives*5\n",
    "        average_score = total_score/(a+b+c+num_fives)\n",
    "        rounded_average = int(average_score+0.5)\n",
    "        return rounded_average >= target_average\n",
    "\n",
    "    left, right = 0, total_grades\n",
    "    while left <= right:\n",
    "        mid = (left+right)//2\n",
    "        if is_valid(mid):\n",
    "            right = mid-1\n",
    "        else:\n",
    "            left = mid+1\n",
    "\n",
    "    return left"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "Введём количество оценок поочерёдно, используем нашу функцию и результат её выполнения выведем на экран."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [
    "def main():\n",
    "    a = int(input().strip())\n",
    "    b = int(input().strip())\n",
    "    c = int(input().strip())\n",
    "\n",
    "    print(min_fives(a, b, c))\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%%\n"
    }
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "Выполненная задача:\n",
    "\n",
    "В лицее на уроках информатики ответы учеников оцениваются целым числом баллов от 2 до 5.\n",
    "Итоговая оценка по информатике выставляется как среднее арифметическое оценок на всех уроках,\n",
    "округленное до ближайшего целого числа. Если среднее значение находится ровно посередине между двумя целыми числами,\n",
    "то оценка округляется вверх.\n",
    "\n",
    "Все ученики лицея стремятся получить итоговую оценку по информатике не ниже 4 баллов.\n",
    "К сожалению, один из учеников получил на уроках a двоек, b троек и c четверок.\n",
    "Теперь он планирует получить несколько пятерок, причем хочет, чтобы итоговая оценка была не меньше 4 баллов.\n",
    "Ему надо понять, какое минимальное количество пятерок ему необходимо получить, чтобы добиться своей цели.\n",
    "\n",
    "Требуется написать программу, которая по заданным целым неотрицательные числам a, b и c определяет\n",
    "минимальное количество пятерок, которое необходимо получить ученику, чтобы его итоговая оценка по информатике\n",
    "была не меньше 4 баллов.\n",
    "\n",
    "Входные данные\n",
    "Входные данные содержат три строки. Первая строка содержит целое неотрицательное число a,\n",
    "вторая строка содержит целое неотрицательное число b, третья строка содержит\n",
    "целое неотрицательное число c (0≤a,b,c≤10^15,a+b+c≥1).\n",
    "\n",
    "Выходные данные\n",
    "\n",
    "Выходные данные должны содержать одно число: минимальное число пятерок, которое необходимо получить ученику,\n",
    "чтобы итоговая оценка была не меньше 4 баллов.\n",
    "\n",
    "Примечание\n",
    "\n",
    "Следует обратить внимание, что входные данные в этой и других задачах не помещаются в стандартный 32 -битный тип данных.\n",
    "Необходимо использовать 64 -битный тип данных (long long в С++, int64 в Паскале, long в Java).\n",
    "\n",
    "Система оценки\n",
    "\n",
    "Баллы за каждую подзадачу начисляются только в случае, если все тесты для этой подзадачи\n",
    "и необходимых подзадач успешно пройдены.\n",
    "Подзадача 1: 13 баллов, 1≤a≤100, b = 0, c = 0 (ученик получал только двойки).\n",
    "Подзадача 2: 14 баллов, a = 0, 1≤b≤100, c = 0 (ученик получал только тройки).\n",
    "Подзадача 3: 15 баллов, 0≤a,b,c≤100, необходимые подзадачи: 1,2.\n",
    "Подзадача 4: 28 баллов, 0≤a,b,c≤10^6, необходимые подзадачи: 1,2,3.\n",
    "Подзадача 5: 30 баллов, 0≤a,b,c≤10^15, необходимые подзадачи: 1,2,3,4."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}