{
 "cells": [
  {
   "cell_type": "markdown",
   "source": [
    "Сортировка методом вставок работает путем последовательного добавления элементов в уже отсортированную часть массива. Внешний цикл проходит по элементам массива, начиная с индекса 1 до n-1 (так как первый элемент уже считается отсортированным). Для каждого элемента на позиции i текущему элементу key присваивается значение array[i].\n",
    "Переменная j инициализируется значением i-1, что указывает на предыдущую позицию в массиве. Внутренний цикл while проверяет, является ли текущий элемент больше key. Если это условие выполняется, элемент сдвигается вправо, пока не будет достигнута позиция, где array[j] меньше или равно key. Элементы массива от j+1 до 0 (если j больше или равно 0) сдвигаются на одну позицию вправо. j уменьшается на 1 на каждой итерации сдвига. После завершения внутреннего цикла, текущий элемент key вставляется на правильную позицию, заменяя сдвинутый элемент array[j+1].\n",
    "Преимущество такого способа сортировки в низком количестве перестановок."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "pycharm": {
     "name": "#%%\n"
    }
   },
   "outputs": [],
   "source": [
    "def main():\n",
    "\n",
    "    n = int(input().strip())\n",
    "    array = list(map(int, input().strip().split()))\n",
    "\n",
    "    for i in range(1, n):\n",
    "        key = array[i]\n",
    "        j = i-1\n",
    "        while j >= 0 and array[j] > key:\n",
    "            array[j+1] = array[j]\n",
    "            j -= 1\n",
    "        array[j+1] = key\n",
    "\n",
    "    print(*array)"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "Выполненная задача:\n",
    "\n",
    "Требуется отсортировать массив по неубыванию методом \"вставок\".\n",
    "\n",
    "Входные данные\n",
    "В первой строке вводится одно натуральное число, не превосходящее 1000 – размер массива.\n",
    "Во второй строке задаются N чисел – элементы массива (целые числа, не превосходящие по модулю 1000).\n",
    "\n",
    "Выходные данные\n",
    "Вывести получившийся массив."
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%% md\n"
    }
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}