"""
Дано число n. Создайте массив размером n×n и заполните его по следующему правилу:
Числа на диагонали, идущей из правого верхнего в левый нижний угол равны 1.
Числа, стоящие выше этой диагонали, равны 0.
Числа, стоящие ниже этой диагонали, равны 2.
Полученный массив выведите на экран. Числа в строке разделяйте одним пробелом.
"""
def main():
    n = int(input())

    # Создаем и инициализируем список
    a = [[0] * n for i in range(n)]

    # Заполнение массива по заданным правилам
    for i in range(n):
        for j in range(n):
            if i + j == n - 1:
                a[i][j] = 1
            elif i + j > n - 1:
                a[i][j] = 2

    # Вывод массива
    for row in a:
        print(*row)

if __name__ == "__main__":
    main()