"""
Профессор Васечкин хочет раскрасить целые числа от 1 до N таким образом, что если число A делится на число B, то числа
A и B должны быть разного цвета. Помогите профессору найти такую раскраску, что число используемых цветов минимально.

Входные данные
Во входном файле записано число N (1 ≤ N ≤ 1000000).
Выходные данные
В первую строку выходного файла выведите M – число цветов в искомой раскраске.
Во вторую строку выведите через пробел искомую раскраску чисел от 1 до N.
Используемые числа должны быть обозначены числами от 1 до M.
"""