"""
Когда Петя учился в школе, он часто участвовал в олимпиадах по информатике, математике и физике.
Так как он был достаточно способным мальчиком и усердно учился, то на многих из этих олимпиад он получал дипломы.
К окончанию школы у него накопилось n  дипломов, причём, как оказалось, все они имели одинаковые размеры:
w — в ширину и h — в высоту.
Сейчас Петя учится в одном из лучших российских университетов и живёт в общежитии со своими одногруппниками.
Он решил украсить свою комнату, повесив на одну из стен свои дипломы за школьные олимпиады.
Так как к бетонной стене прикрепить дипломы достаточно трудно, то он решил купить специальную доску
из пробкового дерева, чтобы прикрепить её к стене, а к ней — дипломы. Для того чтобы эта конструкция выглядела
более красиво, Петя хочет, чтобы доска была квадратной и занимала как можно меньше места на стене.
Каждый диплом должен быть размещён строго в прямоугольнике размером w на h.
Дипломы запрещается поворачивать на 90 градусов. Прямоугольники, соответствующие различным дипломам,
не должны иметь общих внутренних точек. Требуется написать программу, которая вычислит минимальный размер стороны доски,
которая потребуется Пете для размещения всех своих дипломов.

Входные данные
Входной файл содержит три целых числа: w, h, n (1≤w,h,n≤10^9).

Выходные данные
В выходной файл необходимо вывести ответ на поставленную задачу.
"""
def min_board_size(w, h, n):
    left, right = 1, n * max(w, h)

    while left <= right:
        mid = (left + right) // 2
        if can_fit_diplomas(w, h, n, mid):
            right = mid - 1
        else:
            left = mid + 1

    return left


def can_fit_diplomas(w, h, n, side_length):
    max_diplomas_per_row = side_length // w
    max_diplomas_per_col = side_length // h

    total_diplomas = max_diplomas_per_row * max_diplomas_per_col

    return total_diplomas >= n


def main():
    w, h, n = map(int, input().strip().split())
    print(min_board_size(w, h, n))


if __name__ == "__main__":
    main()